[
  {
    "content": "<p style=\"text-align: left;\">Graham Russell &amp; Russell Hitchcock met on May 12, 1975, the first day of rehearsals for \"Jesus Christ Superstar\" in Sydney, Australia; they became instant friends with their common love for The Beatles and, of course, singing.</p>\n<p style=\"text-align: left;\">After the shows' performances at 10:30, they would play pizza parlors, coffee bars and night clubs with just one guitar and two voices. They quickly gained a reputation for great harmonies and for original songs that Graham was constantly writing. They made a demo on a cassette of two songs, \"Love and Other Bruises\" and \"If You Knew Me\" and took it to every record company in Sydney. Everyone turned it down but one &mdash; CBS Records &mdash; who admired their unique style.</p>\n<p style=\"text-align: left;\">They made a single in one afternoon and it shot to number one on the national charts. Air Supply was born! That same year, they opened for Rod Stewart across Australia and then throughout the U.S. and Canada playing all of the famous huge venues before Rod would take the stage. They found new fans, but did not break the U.S. market.</p>\n<p style=\"text-align: left;\">Back in Australia they had to start again and made a record called Life Support. On this record were some treasures of songs, including \"Lost in Love\" which went Top 10 in Australia and somehow found its way to music industry executive Clive Davis in New York.</p>\n<p style=\"text-align: left;\">Clive immediately signed Air Supply to Arista Records and in 1980, \"Lost in Love\" became the fastest selling single in the world, leaping to the top of all of the charts. Now Air Supply was on their way. The second single was \"All Out of Love,\" and that went up the charts even quicker.</p>\n<p style=\"text-align: left;\">Seven top-five singles later, Air Supply at that time had equaled The Beatles' run of consecutive top five singles. The albums Lost in Love, The One That You Love, Now &amp; Forever, and The Greatest Hits sold in excess of 20 million copies. \"Lost in Love\" was named Song of the Year in 1980, and, with the other singles, sold more than 10 million copies.</p>\n<p style=\"text-align: left;\">The trademark sound of Russell Hitchcock's soaring tenor voice and Graham Russell's simple yet majestic songs created a unique sound that would forever be known as Air Supply.</p>\n<p style=\"text-align: left;\">However, it is the live shows that always hold audiences captive around the world. They were the first Western group to tour China, Taiwan, and countless other countries that before would not allow pop music across their borders. In 1983 they recorded \"Making Love Out Of Nothing At All\" by Jim Steinman which solidified the group as a permanent force in modern music. This song was released on The Greatest Hits album which soared past 7 million copies.</p>\n<p style=\"text-align: left;\">\"Lost in Love\", \"All Out of Love\", \"The One That You Love\", \"Sweet Dreams\", and \"Making Love Out Of Nothing At All\" have each achieved multi-million plays on the radio.</p>\n<p style=\"text-align: left;\">In 1986 the group's music was still playing endlessly on radio. That same year, Graham was married to actress Jodi Varble from Rochelle, Illinois, who also was his leading lady in the video for \"Making Love Out Of Nothing At All.\"</p>\n<p style=\"text-align: left;\">Air Supply began to tour with lavish productions in places that no one had been before. In South America and Asia they became a part of everyone's life. In 1988, Air Supply was asked to participate in Australia's bicentennial celebration and to play for HRH Prince Charles and HRH Princess Diana, where they learned both were already ardent fans. This engagement would be one of their most treasured moments in their career.</p>\n<p style=\"text-align: left;\">In 1989, they recorded \"The Earth Is\" album selling over a million copies outside of the U.S. This album was followed by \"The Vanishing Race\" CD and, with the singles \"Goodbye\" and \"It's Never Too Late\", again saw multi-platinum success. The following albums, \"News from Nowhere\", \"Yours Truly\", and \"Across the Concrete Sky\" all gave their second greatest hits album multi-platinum status as they traveled the world each and every year.</p>\n<p style=\"text-align: left;\">In 2000, a new production company was founded to be devoted to Air Supply's entire future product, called A Nice Pear, which gave them complete creative control.</p>\n<p style=\"text-align: left;\">In July 2005, their live DVD, \"It Was 30 Years Ago Today\" celebrated 30 years of success around the world and in that same month, Air Supply smashed attendance records when, in Cuba, at one show they played to 175,000 people. Also 2005 saw the release of \"The Singer and the Song\", an acoustic album of many of their big hits which received critical acclaim.</p>\n<p style=\"text-align: left;\">In May 2010, the long-awaited album, \"Mumbo Jumbo\" &ndash;also the duo's first studio recording in eight years- was released. Recorded at Graham Russell's home studio near Park City, Utah and at Odds On's state of the art facilities in Las Vegas with top session musicians and an orchestra, \"Mumbo Jumbo\" was produced by Russell and engineered by Odds On's Sean O'Dwyer, whose credits include Pink Floyd, Randy Newman and Blink-182. Among the 14-tracks, released by Odds On's label, was the first single \"Dance With Me,\" which earned Air Supply a prominent feature article in Billboard Magazine titled \"Still Supplying The Hits After 35 Years.\"</p>\n<p style=\"text-align: left;\">Just weeks after composer and vocalist Graham Russell was honored with a BMI Million-Air</p>\n<p style=\"text-align: left;\">Certificate recognizing 3 million performances of the duo's hit \"All Out Of Love,\" Air Supply's new song was the #1 most added track on the FMQB AC40 Chart, and also one of the most added on the R&amp;R (Radio and Records) AC Chart and the Mediabase AC chart.</p>\n<p style=\"text-align: left;\">In 2011, the duo continues to play more than 150 shows a year worldwide, including stops in England, Ireland, Israel, Philippines, Korea, Japan, Canada, the U.S. and beyond.</p>\n<p style=\"text-align: left;\">Currently, we just finished filming our live Jerusalem, Israel show for a new DVD that will be out later this year. The DVD will feature two new songs, \"Sanctuary\" and \"Everywhere.\" \"Sanctuary\" will be released as a single on iTunes by October, 2011.</p>\n<p style=\"text-align: left;\"><strong>Tickets on sale 7/27 at Noon</strong></p>",
    "_template": "html"
  }
]